Revit 2027 API
ElementCategoryFilter(ElementId, Boolean) Constructor
 Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementCategoryFilter(
	ElementId categoryId,
	bool inverted
)
Public Sub New (
	categoryId As ElementId,
	inverted As Boolean
)
public:
ElementCategoryFilter(
	ElementId^ categoryId,
	bool inverted
)
new :
        categoryId : ElementId *
        inverted : bool -> ElementCategoryFilter
Parameters
categoryId ElementId
 The category id to match.
inverted Boolean
 True if the filter should match all elements which are not of the given category.
Exceptions
Exception | Condition
ArgumentException |  The category was not valid for filtering.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementCategoryFilter Class
ElementCategoryFilter Overload
Autodesk.Revit.DB Namespace